# FloorArea Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..FloorArea Property
MassZone Class See Also
---
The floor area of the MassZone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double FloorArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FloorArea As Double
	Get
```

Visual C++
---
```text
public:
property double FloorArea {
	double get ();
}
```

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace